"""
==========================
  练习 01:基础巩固
  用到的知识:变量、数据类型、输入输出、运算符
  难度:★☆☆☆☆
  规则:每道题先自己思考,卡住再看题下的【小提示】
==========================
"""
from os import name

# ------------------------------------------------------------
# 题目 1:温度转换器
# 输入一个摄氏温度,输出对应的华氏温度
# 公式:F = C × 9 / 5 + 32
# 例:输入 25 → 输出 华氏温度:77.0
# ------------------------------------------------------------
# 【小提示】
# input() 得到的是字符串,需要 int() 或 float() 转成数字
# 把转换结果存在变量里,再 print 出来

# 您的代码写在这里 ↓↓↓
c = float(input("请输入摄氏温度："))
f = c * 9 / 5 +32
print(f"摄氏温度{c}=华氏温度{f}")
print("------------------------------")

# ------------------------------------------------------------
# 题目 2:四则运算器
# 输入两个整数,分别输出它们的 和、差、积、商、余数
# 例:输入 10 和 3 → 输出 13、7、30、3、1
# ------------------------------------------------------------
# 【小提示】
# 商用 //(整除),余数用 %(取余)

# 您的代码写在这里 ↓↓↓
num1 = int(input("请输入第一个整数："))
num2 = int(input("请输入第二个整数："))
print(f"和：{num1 + num2}")
print(f"差：{num1 - num2}")
print(f"积：{num1 * num2}")
print(f"商：{num1 // num2}")
print(f"余数：{num1 % num2}")
print("------------------------------")

# ------------------------------------------------------------
# 题目 3:圆的面积
# 输入半径(可能是小数),输出圆的面积
# 公式:面积 = 3.14 × 半径 × 半径
# 例:输入 2 → 输出 12.56
# ------------------------------------------------------------
# 【小提示】
# 半径可能是小数,用 float() 转换
# 半径 × 半径 也可以写成 半径 ** 2

# 您的代码写在这里 ↓↓↓
r = float(input("输入半径:"))
print(f"圆的面积为{3.14 * r**2}")

# ------------------------------------------------------------
# 题目 4(自由发挥):自我介绍
# 用变量保存您的 姓名 和 年龄,输出一句话:
# 例:我叫小明,今年18岁,正在学习Python!
# ------------------------------------------------------------
# 【小提示】
# f-string 用法:f"我叫{name},今年{age}岁"

# 您的代码写在这里 ↓↓↓
name = "H0PE"
age = 20
print(f"我叫{name},今年{age}岁")
