"""
==========================
  练习 03:循环练习
  用到的知识:while、for、break、continue、range
  难度:★★★☆☆
  规则:每道题先自己思考,卡住再看题下的【小提示】
==========================
"""

# ------------------------------------------------------------
# 题目 1:1~100 求和
# 用 for 循环 和 while 循环 各写一遍,输出结果(答案:5050)
# ------------------------------------------------------------
# 【小提示】
# 需要一个"累加变量",每循环一次就往里加
# for:for i in range(1, 101)
# while:定义 i = 1,循环里 i += 1

# 您的代码写在这里 ↓↓↓
# while循环
i = 0
num_sum = 0
while i <= 100:
    num_sum += i
    i += 1
print(num_sum)
print("------------------------------")

# for循环
num2_sum = 0
for j in range(1,101):
    num2_sum += j
print(num2_sum)
print("------------------------------")

# ------------------------------------------------------------
# 题目 2:九九乘法表
# 输出如下(前3行示例):
#   1x1=1
#   1x2=2 2x2=4
#   1x3=3 2x3=6 3x3=9
# ------------------------------------------------------------
# 【小提示】
# 需要两层循环:外层控制行(1~9),内层控制列(1~当前行数)
# print(..., end="\t") 可以不换行,print() 单独一行用来换行
# 内层循环范围是 range(1, i + 1),想一想为什么

# 您的代码写在这里 ↓↓↓
for i in range(1,10): #外层控制行
    for j in range(1,i+1):
        print(f"{j} * {i} = {j*i}",end="\t")
    print()
print("------------------------------")

# ------------------------------------------------------------
# 题目 3:三角形星星
# 用循环输出 5 行三角形:
#   *
#   **
#   ***
#   ****
#   *****
# ------------------------------------------------------------
# 【小提示】
# 第 i 行有 i 个 *,用字符串乘法 "*" * i 最简单
# 或者用内层循环打印

# 您的代码写在这里 ↓↓↓
for m in range(1,6):
    print(f"{m * "*"}")
print("------------------------------")

# ------------------------------------------------------------
# 题目 4:偶数和(continue 练习)
# 计算 1~50 之间所有偶数的和
# 要求:必须用 continue 跳过奇数
# ------------------------------------------------------------
# 【小提示】
# if i % 2 == 1: continue  ← 跳过奇数
# 其余数字累加

# 您的代码写在这里 ↓↓↓
num = 0
for i in range(1,51):
    if i % 2 == 1:
        continue
    num += i
print(num)

# ------------------------------------------------------------
# 题目 5:猜数字(简单版)
# 系统随机 1~50 的数字,用户猜,猜错提示"大了/小了"
# 猜对后输出一共猜了几次
# ------------------------------------------------------------
# 【小提示】
# random.randint(1, 50) 生成随机数
# 用一个 count 变量计数,每猜一次 count += 1

# 您的代码写在这里 ↓↓↓
# 生成随机数
import random
number = random.randint(1,50)
num_1 = 0
count = 0
while True:
    num_1 = int(input("请输入你觉得正确的数字："))
    if num_1 > number:
        print("猜大了")
        count += 1
        continue
    elif num_1 < number:
        print("猜小了")
        count += 1
        continue
    else:
        count += 1
        break
print(f"恭喜你猜对了是{number},一共用了{count}次")

