"""
贪心算法的核心：
    ·核心思想：每一步都做出当前看起来最优的选择（局部最优），以此来得出全局最优解。
    ·但不一定能得到全局最优解！！！
    ·贪心选择性质：通过局部最优可以得出全局最优。
    ·最优子结构：问题的最优解一点包含子问题的最优解。
    ·我国的纸币的面值设计成这样就是符合贪心思想，方便交易。

找零问题：
    现在有5元，2元，1元三种面值的纸币，现在需要找给顾客若干面值的纸币，怎么样让找的纸币数量最少？
    本能的反应就是先找大面值的，这就是一个贪心思想的体现。
"""

def greedy_change(n):
    # 定义一个列表，包含所有面值，从大到小排
    arr = [5,2,1]
    # 索引i，从最大面值开始
    i = 0
    res = 0
    # 判断当前面值为不为0，不为0能不能找当前货币的面值
    while n:
        if n >= arr[i]:
            # 能找几张当前面值的纸币
            cnt = n // arr[i]
            # 剩余面值
            n -= cnt * arr[i]
            # res记录找了纸币的数量
            res += cnt
        else:
            # 去用更小的面值找零
            i += 1
    return res

n = int(input('输入金额：'))
print(f"最少找零{greedy_change(n)}张")
"""
    ·笑话：小明用一张15块的假币去买一个1块钱的雪糕，结果找回来两张7块的。
    
    ·如果纸币的面值设置是15、7、1可不可以用贪心？
    
    ·反例21。在该纸币面值下最优解是3张7块。用贪心求出来的是1张15块和6张1块
"""

